# print('定制自己的手机套餐')
#
# print('A.请设置通话时长：'+ '\n' + '1.0分钟'
#       + '\n' + '2.50分钟' + '\n' + '3.100分钟' +
#       '\n' + '4.300分钟' + '\n' + '5.不限量')
# L1 = {'1':'0分钟','2':'50分钟','3':'100分钟','4':'300分钟','5':'不限量'}
# input1 = input('输入选择的通话时间编号：')
#
# print('\nB.请设置流量：'+ '\n' + '1.0M'
#       + '\n' + '2.500M' + '\n' + '3.1G' +
#       '\n' + '4.5G' + '\n' + '5.不限量')
# L2 = {'1':'0M','2':'500M','3':'1G','4':'5G','5':'不限量'}
# input2 = input('输入选择的通话时间编号：')
#
# print('\nC.请设置短信条数:' + '\n' + '1.0条'
#       + '\n' + '2.50条' + '\n' + '3.100条')
# L3 = {'1':'0条','2':'50条','3':'100条'}
# input3 = input('输入选择的通话时间编号：')
#
#
# print('你的手机套餐定制成功：免费通话时间为{0}/月，流量为{1}/月，短信条数为{2}/月'.format(
# L1[input1],L2[input2],L3[input3]))

def check(x, y):
    try:
        x = int(x)
    except:
        x = input('你输入的套餐不存在，请重新输入：')
        return check(x, y)
    if x > 0 and x <= y:
        return x
    else:
        x = input('你输入的套餐不存在，请重新输入：')
        return check(x, y)


# 可设置话费列表
Bill_sets = ['0分钟', '50分钟', '100分钟', '300分钟', '不限量']
# 可设置流量列表
flow_sets = ['0M', '500M', '1G', '5G', '不限量']
# 可设置短信列表
sms_sets = ['0条', '50条', '100条 ']
# 控制台输出提示
print('定制自己的手机套餐:')
# 通话设置
print('{}\n{}\n{}\n{}\n{}\n{}'.format('A.请设置通话时长:', "1." + Bill_sets[0], "2." + Bill_sets[1], "3." + Bill_sets[2],
                                      "4." + Bill_sets[3], "5." + Bill_sets[4]))
# 提示用户输入选择通话时间
Aset = input("输入选择的通话时间编号：")
# 检测输入内容的合法性 并返回正确内容
Aset = check(Aset, 5)
# 提示用户设置流量
print('\n{}\n{}\n{}\n{}\n{}\n{}'.format('B.请设置流量:', "1." + flow_sets[0], "2." + flow_sets[1], "3." + flow_sets[2],
                                        "4." + flow_sets[3], "5." + flow_sets[4]))
# 提示用户输入选择流量
Bset = input("输入选择的通话时间编号：")
# 检测输入内容的合法性 并返回正确内容
Bset = check(Bset, 5)
# 提示用户设置短信条数
print('\n{}\n{}\n{}\n{}'.format('C.请设置短信条数:', "1." + sms_sets[0], "2." + sms_sets[1], "3." + sms_sets[2]))
# 提示用户输入选择短信条数
Cset = input("输入选择的通话时间编号：")
# 检测输入内容的合法性 并返回正确内容
Cset = check(Cset, 3)
print('\n您的手机套餐定制成功：免费通话时长为' + Bill_sets[Aset - 1] + '/月 ,流量为' + flow_sets[Bset - 1] + '/月，短信条数' + sms_sets[
    Cset - 1] + '/月')
